{
	"name": "1 Finance SQL Pool Security DDM",
	"properties": {
		"content": {
			"query": "/*****For Demonstration purpose only, Please customize as per your enterprise security needs and compliances*****/\r\n/* **DISCLAIMER**\r\nBy accessing this code, you acknowledge the code is made available for presentation and demonstration purposes only and that the code: (1) is not subject to SOC 1 and SOC 2 compliance audits; (2) is not designed or intended to be a substitute for the professional advice, diagnosis, treatment, or judgment of a certified financial services professional; (3) is not designed, intended or made available as a medical device; and (4) is not designed or intended to be a substitute for professional medical advice, diagnosis, treatment or judgement. Do not use this code to replace, substitute, or provide professional financial advice or judgment, or to replace, substitute or provide medical advice, diagnosis, treatment or judgement. You are solely responsible for ensuring the regulatory, legal, and/or contractual compliance of any use of the code, including obtaining any authorizations or consents, and any solution you choose to build that incorporates this code in whole or in part.  */\r\n\r\n-- Step:1(View the existing table 'CustomerInfo' Data) \r\nselect top 100 * from CustomerInfo\r\n\r\n-- Step:2 Let's confirm that there are no Dynamic Data Masking (DDM) applied on columns\r\nExec [Confirm DDM]\r\n-- No results returned verify that no data masking has been done yet.\r\n\r\n-- Step:3 Now lets mask 'Medical Insurance Card' and 'Email' Column of 'CustomerInfo' table.\r\nALTER TABLE CustomerInfo  \r\nALTER COLUMN [CreditCard] ADD MASKED WITH (FUNCTION = 'partial(0,\"XXX-XXX-XXXX-\",4)')\r\nGO\r\nALTER TABLE CustomerInfo \r\nAlter Column Email ADD MASKED WITH (FUNCTION = 'email()')\r\nGO\r\n-- The columns are sucessfully masked.\r\n\r\n-- Step:4 Let's see Dynamic Data Masking (DDM) applied on the two columns.\r\nExec [Confirm DDM]\r\n\r\n-- Step:5 Now, let us grant SELECT permission to 'MarketingOfficer'sysusers on the 'CustomerInfo' table.\r\nSELECT Name as [User] FROM sys.sysusers WHERE name = N'MarketingOfficer'\r\nGRANT SELECT ON CustomerInfo TO MarketingOfficer;  \r\n\r\n-- Step:6 Logged in as  'MarketingOfficer' let us execute the select query and view the result.\r\nEXECUTE AS USER =N'MarketingOfficer';  \r\nSELECT  * FROM CustomerInfo; \r\n\r\n-- Step:7 Let us Remove the data masking using UNMASK permission\r\nGRANT UNMASK TO MarketingOfficer\r\nEXECUTE AS USER = 'MarketingOfficer';  \r\nSELECT top 10 * FROM CustomerInfo; \r\nrevert; \r\nREVOKE UNMASK TO MarketingOfficer;  \r\n\r\n----step:8 Reverting all the changes back to as it was.\r\nALTER TABLE CustomerInfo\r\nALTER COLUMN [CreditCard] DROP MASKED;\r\nGO\r\nALTER TABLE CustomerInfo\r\nALTER COLUMN Email DROP MASKED;\r\nGO",
			"metadata": {
				"language": "sql"
			},
			"currentConnection": {
				"name": "FsiDW",
				"type": "SqlPool"
			}
		},
		"type": "SqlQuery"
	}
}